morbos/STM32/WB/SVD/STM32WB55x.svd
       <register>
         <name>AHB1ENR</name>
         <displayName>AHB1ENR</displayName>
         <addressOffset>0x048</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TSCEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRCEN</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAMUX1EN</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMA2EN</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMA1EN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AHB2ENR</name>
         <displayName>AHB2ENR</displayName>
         <addressOffset>0x04C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AES1EN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADCEN</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOHEN</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOEEN</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIODEN</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOCEN</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOBEN</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOAEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AHB3ENR</name>
         <displayName>AHB3ENR</displayName>
         <addressOffset>0x050</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FLASHEN</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>IPCCEN</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>HSEMEN</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RNGEN</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AES2EN</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PKAEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>QUADSPIEN</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>APB1ENR1</name>
         <displayName>APB1ENR1</displayName>
         <addressOffset>0x058</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LPTIM1EN</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>USBEN</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRSEN</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>I2C3EN</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>I2C1EN</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SPI2EN</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WWDGEN</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RTCAPBEN</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCDEN</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM2EN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>APB1ENR2</name>
         <displayName>APB1ENR2</displayName>
         <addressOffset>0x05C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LPTIM2EN</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LPUART1EN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>APB2ENR</name>
         <displayName>APB2ENR</displayName>
         <addressOffset>0x060</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SAI1EN</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM17EN</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM16EN</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>USART1EN</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SPI1EN</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM1EN</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AHB1SMENR</name>
         <displayName>AHB1SMENR</displayName>
         <addressOffset>0x068</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TSCSMEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRCSMEN</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SRAM1SMEN</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAMUX1SMEN</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMA2SMEN</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMA1SMEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AHB2SMENR</name>
         <displayName>AHB2SMENR</displayName>
         <addressOffset>0x06C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AES1SMEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADCFSSMEN</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOHSMEN</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOESMEN</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIODSMEN</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOCSMEN</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOBSMEN</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>GPIOASMEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AHB3SMENR</name>
         <displayName>AHB3SMENR</displayName>
         <addressOffset>0x070</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FLASHSMEN</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SRAM2SMEN</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RNGSMEN</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AES2SMEN</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PKASMEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>QUADSPISMEN</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>APB1SMENR1</name>
         <displayName>APB1SMENR1</displayName>
         <addressOffset>0x078</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LPTIM1SMEN</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>USBSMEN</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRSSMEN</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>I2C3SMEN</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>I2C1SMEN</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SPI2SMEN</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WWDGSMEN</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RTCAPBSMEN</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCDSMEN</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM2SMEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>APB1SMENR2</name>
         <displayName>APB1SMENR2</displayName>
         <addressOffset>0x07C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LPTIM2SMEN</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LPUART1SMEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>APB2SMENR</name>
         <displayName>APB2SMENR</displayName>
         <addressOffset>0x080</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SAI1SMEN</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM17SMEN</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM16SMEN</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>USART1SMEN</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SPI1SMEN</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIM1SMEN</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCIPR</name>
         <displayName>CCIPR</displayName>
         <addressOffset>0x088</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RNGSEL</name>
             <bitOffset>30</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>ADCSEL</name>
             <bitOffset>28</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CLK48SEL</name>
             <bitOffset>26</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SAI1SEL</name>
             <bitOffset>22</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>LPTIM2SEL</name>
             <bitOffset>20</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>LPTIM1SEL</name>
             <bitOffset>18</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>I2C3SEL</name>
             <bitOffset>16</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>I2C1SEL</name>
             <bitOffset>12</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>LPUART1SEL</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>USART1SEL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BDCR</name>
         <displayName>BDCR</displayName>
         <addressOffset>0x090</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LSCOSEL</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSCOEN</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BDRST</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RTCEN</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RTC_SEL</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>LSECSSD</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSECSSON</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSE_DRV</name>
             <bitOffset>3</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>LSEBYP</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSERDY</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSEON</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CSR</name>
         <displayName>CSR</displayName>
         <addressOffset>0x094</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LPWRRSTF</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WWDGRSTF</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>IWDGRSTF</name>
             <bitOffset>29</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SFTRSTF</name>
             <bitOffset>28</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BORRSTF</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PINRSTF</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OBLRSTF</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RMVF</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RFRSTS</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RFWKPSEL</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>LSI2TRIM</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>LSI2RDY</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSI2ON</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSI1RDY</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSI1ON</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CRRCR</name>
         <displayName>CRRCR</displayName>
         <addressOffset>0x098</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>HSI48CAL</name>
             <bitOffset>7</bitOffset>
             <bitWidth>9</bitWidth>
           </field>
           <field>
             <name>HSI48RDY</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>HSI48ON</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>HSECR</name>
         <displayName>HSECR</displayName>
         <addressOffset>0x09C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>HSETUNE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>HSEGMC</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>HSES</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>UNLOCKED</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>EXTCFGR</name>
         <displayName>EXTCFGR</displayName>
         <addressOffset>0x108</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RFCSS</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>C2HPREF</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SHDHPREF</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>C2HPRE</name>
             <bitOffset>4</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>SHDHPRE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
         </fields>
       </register>
