morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>ADC</name>
     <groupName>ADC</groupName>
     <baseAddress>0x50040000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>ADC</name>
       <value>18</value>
     </interrupt>
     <registers>
       <register>
         <name>ISR</name>
         <displayName>ISR</displayName>
         <addressOffset>0x00</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JQOVF</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD3</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD2</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD1</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JEOS</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JEOC</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOS</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOC</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOSMP</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADRDY</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>IER</name>
         <displayName>IER</displayName>
         <addressOffset>0x04</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JQOVFIE</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD3IE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD2IE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD1IE</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JEOSIE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JEOCIE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVRIE</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOSIE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOCIE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOSMPIE</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADRDYIE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ADCAL</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADCALDIF</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DEEPPWD</name>
             <bitOffset>29</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADVREGEN</name>
             <bitOffset>28</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JADSTP</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADSTP</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JADSTART</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADSTART</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADDIS</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CFGR</name>
         <displayName>CFGR</displayName>
         <addressOffset>0x0C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JQDIS</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD1CH</name>
             <bitOffset>26</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>JAUTO</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JAWD1EN</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD1EN</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD1SGL</name>
             <bitOffset>22</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JQM</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JDISCEN</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DISCNUM</name>
             <bitOffset>17</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DISCEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AUTDLY</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CONT</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVRMOD</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EXTEN</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>EXTSEL3</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EXTSEL2</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EXTSEL1</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EXTSEL0</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ALIGN</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RES</name>
             <bitOffset>3</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>DMACFG</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CFGR2</name>
         <displayName>CFGR2</displayName>
         <addressOffset>0x10</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ROVSM</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TROVS</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVSS</name>
             <bitOffset>5</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>OVSR</name>
             <bitOffset>2</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>JOVSE</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ROVSE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SMPR1</name>
         <displayName>SMPR1</displayName>
         <addressOffset>0x14</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SMP9</name>
             <bitOffset>27</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP8</name>
             <bitOffset>24</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP7</name>
             <bitOffset>21</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP6</name>
             <bitOffset>18</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP5</name>
             <bitOffset>15</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP4</name>
             <bitOffset>12</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP3</name>
             <bitOffset>9</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP2</name>
             <bitOffset>6</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP1</name>
             <bitOffset>3</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SMPR2</name>
         <displayName>SMPR2</displayName>
         <addressOffset>0x18</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SMP18</name>
             <bitOffset>24</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP17</name>
             <bitOffset>21</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP16</name>
             <bitOffset>18</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP14</name>
             <bitOffset>12</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP13</name>
             <bitOffset>9</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP12</name>
             <bitOffset>6</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP11</name>
             <bitOffset>3</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMP10</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>TR1</name>
         <displayName>TR1</displayName>
         <addressOffset>0x20</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>HT1</name>
             <bitOffset>16</bitOffset>
             <bitWidth>12</bitWidth>
           </field>
           <field>
             <name>LT1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>12</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>TR2</name>
         <displayName>TR2</displayName>
         <addressOffset>0x24</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>HT2</name>
             <bitOffset>16</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>LT2</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>TR3</name>
         <displayName>TR3</displayName>
         <addressOffset>0x28</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>HT3</name>
             <bitOffset>16</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>LT3</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SQR1</name>
         <displayName>SQR1</displayName>
         <addressOffset>0x30</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SQ4</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ3</name>
             <bitOffset>18</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ2</name>
             <bitOffset>12</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ1</name>
             <bitOffset>6</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>L</name>
             <bitOffset>0</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SQR2</name>
         <displayName>SQR2</displayName>
         <addressOffset>0x34</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SQ9</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ8</name>
             <bitOffset>18</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ7</name>
             <bitOffset>12</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ5</name>
             <bitOffset>0</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SQR3</name>
         <displayName>SQR3</displayName>
         <addressOffset>0x38</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SQ14</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ13</name>
             <bitOffset>18</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ11</name>
             <bitOffset>6</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ10</name>
             <bitOffset>0</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SQR4</name>
         <displayName>SQR4</displayName>
         <addressOffset>0x3C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SQ16</name>
             <bitOffset>6</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SQ15</name>
             <bitOffset>0</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DR</name>
         <displayName>DR</displayName>
         <addressOffset>0x40</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RDATA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>JSQR</name>
         <displayName>JSQR</displayName>
         <addressOffset>0x4C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JSQ4</name>
             <bitOffset>26</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>JSQ3</name>
             <bitOffset>20</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>JSQ2</name>
             <bitOffset>14</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>JSQ1</name>
             <bitOffset>8</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>JEXTEN</name>
             <bitOffset>6</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>JEXTSEL</name>
             <bitOffset>2</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>JL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OFR1</name>
         <displayName>OFR1</displayName>
         <addressOffset>0x60</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OFFSET1_EN</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OFFSET1_CH</name>
             <bitOffset>26</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>OFFSET1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>12</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OFR2</name>
         <displayName>OFR2</displayName>
         <addressOffset>0x64</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OFFSET2_EN</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OFFSET2_CH</name>
             <bitOffset>26</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>OFFSET2</name>
             <bitOffset>0</bitOffset>
             <bitWidth>12</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OFR3</name>
         <displayName>OFR3</displayName>
         <addressOffset>0x68</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OFFSET3_EN</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OFFSET3_CH</name>
             <bitOffset>26</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>OFFSET3</name>
             <bitOffset>0</bitOffset>
             <bitWidth>12</bitWidth>
           </field>
         </fields>
       </register>
