morbos/STM32/WB/SVD/STM32WB55x.svd
       <register>
         <name>OFR4</name>
         <displayName>OFR4</displayName>
         <addressOffset>0x6C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OFFSET4_EN</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OFFSET4_CH</name>
             <bitOffset>26</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>OFFSET4</name>
             <bitOffset>0</bitOffset>
             <bitWidth>12</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>JDR1</name>
         <displayName>JDR1</displayName>
         <addressOffset>0x80</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JDATA1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>JDR2</name>
         <displayName>JDR2</displayName>
         <addressOffset>0x84</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JDATA2</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>JDR3</name>
         <displayName>JDR3</displayName>
         <addressOffset>0x88</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JDATA3</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>JDR4</name>
         <displayName>JDR4</displayName>
         <addressOffset>0x8C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JDATA4</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AWD2CR</name>
         <displayName>AWD2CR</displayName>
         <addressOffset>0xA0</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AWD2CH</name>
             <bitOffset>0</bitOffset>
             <bitWidth>19</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AWD3CR</name>
         <displayName>AWD3CR</displayName>
         <addressOffset>0xA4</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AWD3CH</name>
             <bitOffset>0</bitOffset>
             <bitWidth>19</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DIFSEL</name>
         <displayName>DIFSEL</displayName>
         <addressOffset>0xB0</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DIFSEL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>19</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CALFACT</name>
         <displayName>CALFACT</displayName>
         <addressOffset>0xB4</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CALFACT_D</name>
             <bitOffset>16</bitOffset>
             <bitWidth>7</bitWidth>
           </field>
           <field>
             <name>CALFACT_S</name>
             <bitOffset>0</bitOffset>
             <bitWidth>7</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CSR</name>
         <displayName>CSR</displayName>
         <addressOffset>0x300</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>JQOVF_MST</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD3_MST</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD2_MST</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AWD1_MST</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JEOS_MST</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>JEOC_MST</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVR_MST</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOS_MST</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOC_MST</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOSMP_MST</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADRDY_MST</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCR</name>
         <displayName>CCR</displayName>
         <addressOffset>0x308</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CH18SEL</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CH17SEL</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>VREFEN</name>
             <bitOffset>22</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PRESC</name>
             <bitOffset>18</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>CKMODE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
