morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>SPI1</name>
     <groupName>SPI</groupName>
     <baseAddress>0x40013000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>SPI1</name>
       <value>34</value>
     </interrupt>
     <registers>
       <register>
         <name>CR1</name>
         <displayName>CR1</displayName>
         <addressOffset>0x00</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>BIDIMODE</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BIDIOE</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRCEN</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRCNEXT</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRCL</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RXONLY</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SSM</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SSI</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSBFIRST</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SPE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR</name>
             <bitOffset>3</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>MSTR</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CPOL</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CPHA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR2</name>
         <displayName>CR2</displayName>
         <addressOffset>0x04</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LDMA_TX</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LDMA_RX</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FRXTH</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DS</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>TXEIE</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RXNEIE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ERRIE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FRF</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>NSSP</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SSOE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TXDMAEN</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RXDMAEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR</name>
         <displayName>SR</displayName>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FTLVL</name>
             <bitOffset>11</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>FRLVL</name>
             <bitOffset>9</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>FRE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BSY</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVR</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MODF</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRCERR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TXE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RXNE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DR</name>
         <displayName>DR</displayName>
         <addressOffset>0x0C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CRCPR</name>
         <displayName>CRCPR</displayName>
         <addressOffset>0x10</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CRCPOLY</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>RXCRCR</name>
         <displayName>RXCRCR</displayName>
         <addressOffset>0x14</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RXCRC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>TXCRCR</name>
         <displayName>TXCRCR</displayName>
         <addressOffset>0x18</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TXCRC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
