morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>CRC</name>
     <groupName>CRC</groupName>
     <baseAddress>0x40023000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <registers>
       <register>
         <name>DR</name>
         <displayName>DR</displayName>
         <addressOffset>0x00</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>IDR</name>
         <displayName>IDR</displayName>
         <addressOffset>0x04</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IDR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>REV_OUT</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>REV_IN</name>
             <bitOffset>5</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>POLYSIZE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>RESET</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>INIT</name>
         <displayName>INIT</displayName>
         <addressOffset>0x10</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CRC_INIT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>POL</name>
         <displayName>POL</displayName>
         <addressOffset>0x14</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>POLY</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
     </registers>
   </peripheral>
   <peripheral>
     <name>DMAMUX</name>
     <groupName>DMAMUX</groupName>
     <baseAddress>0x40020800</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>DMAMUX_OVR</name>
       <value>62</value>
     </interrupt>
     <registers>
       <register>
         <name>C0CR</name>
         <displayName>C0CR</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C1CR</name>
         <displayName>C1CR</displayName>
         <addressOffset>0x004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2CR</name>
         <displayName>C2CR</displayName>
         <addressOffset>0x008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C3CR</name>
         <displayName>C3CR</displayName>
         <addressOffset>0x00C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C4CR</name>
         <displayName>C4CR</displayName>
         <addressOffset>0x010</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C5CR</name>
         <displayName>C5CR</displayName>
         <addressOffset>0x014</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C6CR</name>
         <displayName>C6CR</displayName>
         <addressOffset>0x018</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>1</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C7CR</name>
         <displayName>C7CR</displayName>
         <addressOffset>0x01C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C8CR</name>
         <displayName>C8CR</displayName>
         <addressOffset>0x020</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C9CR</name>
         <displayName>C9CR</displayName>
         <addressOffset>0x024</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C10CR</name>
         <displayName>C10CR</displayName>
         <addressOffset>0x028</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C11CR</name>
         <displayName>C11CR</displayName>
         <addressOffset>0x02C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C12CR</name>
         <displayName>C12CR</displayName>
         <addressOffset>0x030</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C13CR</name>
         <displayName>C13CR</displayName>
         <addressOffset>0x034</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNC_ID</name>
             <bitOffset>24</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>NBREQ</name>
             <bitOffset>19</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EGE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SOIE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAREQ_ID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
         </fields>
       </register>
