morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>EXTI</name>
     <groupName>EXTI</groupName>
     <baseAddress>0x58000800</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>PVD</name>
       <value>1</value>
     </interrupt>
     <interrupt>
       <name>EXTI0</name>
       <value>6</value>
     </interrupt>
     <interrupt>
       <name>EXTI1</name>
       <value>7</value>
     </interrupt>
     <interrupt>
       <name>EXTI2</name>
       <value>8</value>
     </interrupt>
     <interrupt>
       <name>EXTI3</name>
       <value>9</value>
     </interrupt>
     <interrupt>
       <name>EXTI4</name>
       <value>10</value>
     </interrupt>
     <interrupt>
       <name>EXTI9_5</name>
       <value>23</value>
     </interrupt>
     <interrupt>
       <name>EXTI15_10</name>
       <value>40</value>
     </interrupt>
     <registers>
       <register>
         <name>RTSR1</name>
         <displayName>RTSR1</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RT</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>22</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>FTSR1</name>
         <displayName>FTSR1</displayName>
         <addressOffset>0x004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FT</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>22</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SWIER1</name>
         <displayName>SWIER1</displayName>
         <addressOffset>0x008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SWI</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SWI</name>
             <bitOffset>0</bitOffset>
             <bitWidth>22</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PR1</name>
         <displayName>PR1</displayName>
         <addressOffset>0x00C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PIF</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PIF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>22</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>RTSR2</name>
         <displayName>RTSR2</displayName>
         <addressOffset>0x020</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RT</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>RT33</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>FTSR2</name>
         <displayName>FTSR2</displayName>
         <addressOffset>0x024</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FT</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>FT33</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SWIER2</name>
         <displayName>SWIER2</displayName>
         <addressOffset>0x028</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SWI</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SWI33</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PR2</name>
         <displayName>PR2</displayName>
         <addressOffset>0x02C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PIF</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PIF33</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>IMR1</name>
         <displayName>IMR1</displayName>
         <addressOffset>0x080</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IM</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>EMR1</name>
         <displayName>EMR1</displayName>
         <addressOffset>0x084</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>EM</name>
             <bitOffset>17</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>EM</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>IMR2</name>
         <displayName>IMR2</displayName>
         <addressOffset>0x090</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IM</name>
             <bitOffset>0</bitOffset>
             <bitWidth>17</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>EMR2</name>
         <displayName>EMR2</displayName>
         <addressOffset>0x094</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>EM</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>EM33</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2IMR1</name>
         <displayName>C2IMR1</displayName>
         <addressOffset>0x0C0</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IM</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2EMR1</name>
         <displayName>C2EMR1</displayName>
         <addressOffset>0x0C4</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>EM</name>
             <bitOffset>17</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>EM</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2IMR2</name>
         <displayName>C2IMR2</displayName>
         <addressOffset>0x0D0</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IM</name>
             <bitOffset>0</bitOffset>
             <bitWidth>17</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2EMR2</name>
         <displayName>C2EMR2</displayName>
         <addressOffset>0x0D4</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>EM</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>EM33</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
