morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>FLASH</name>
     <groupName>FLASH</groupName>
     <baseAddress>0x58004000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>FLASH</name>
       <value>4</value>
     </interrupt>
     <registers>
       <register>
         <name>ACR</name>
         <displayName>ACR</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>EMPTY</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PES</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DCRST</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ICRST</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DCEN</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ICEN</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PRFTEN</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LATENCY</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>KEYR</name>
         <displayName>KEYR</displayName>
         <addressOffset>0x008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>KEYR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OPTKEYR</name>
         <displayName>OPTKEYR</displayName>
         <addressOffset>0x00C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OPTKEYR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR</name>
         <displayName>SR</displayName>
         <addressOffset>0x010</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PESD</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CFGBSY</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BSY</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPTVERR</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RDERR</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPTNV</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FASTERR</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MISERR</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PGSERR</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SIZERR</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PGAERR</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WRPERR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PROGERR</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPERR</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOP</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x014</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPTLOCK</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OBL_LAUNCH</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RDERRIE</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ERRIE</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOPIE</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSTPG</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPTSTRT</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>STRT</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PNB</name>
             <bitOffset>3</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>MER</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PER</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PG</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ECCR</name>
         <displayName>ECCR</displayName>
         <addressOffset>0x018</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ECCD</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ECCC</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CPUID</name>
             <bitOffset>26</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>ECCCIE</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYSF_ECC</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ADDR_ECC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>17</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OPTR</name>
         <displayName>OPTR</displayName>
         <addressOffset>0x020</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AGC_TRIM</name>
             <bitOffset>29</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>nBOOT0</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>nSWBOOT0</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SRAM2_RST</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SRAM2_PE</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>nBOOT1</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WWDG_SW</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>IWDG_STBY</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>IWDG_STOP</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>IWDG_SW</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>nRST_SHDW</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>nRST_STDBY</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>nRST_STOP</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BOR_LEV</name>
             <bitOffset>9</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>ESE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RDP</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PCROP1ASR</name>
         <displayName>PCROP1ASR</displayName>
         <addressOffset>0x024</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PCROP1A_STRT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>9</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PCROP1AER</name>
         <displayName>PCROP1AER</displayName>
         <addressOffset>0x028</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PCROP_RDP</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PCROP1A_END</name>
             <bitOffset>0</bitOffset>
             <bitWidth>9</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>WRP1AR</name>
         <displayName>WRP1AR</displayName>
         <addressOffset>0x02C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>WRP1A_END</name>
             <bitOffset>16</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>WRP1A_STRT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>WRP1BR</name>
         <displayName>WRP1BR</displayName>
         <addressOffset>0x030</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>WRP1B_END</name>
             <bitOffset>16</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>WRP1B_STRT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PCROP1BSR</name>
         <displayName>PCROP1BSR</displayName>
         <addressOffset>0x034</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PCROP1B_STRT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>9</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PCROP1BER</name>
         <displayName>PCROP1BER</displayName>
         <addressOffset>0x038</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PCROP1B_END</name>
             <bitOffset>0</bitOffset>
             <bitWidth>9</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>IPCCBR</name>
         <displayName>IPCCBR</displayName>
         <addressOffset>0x03C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IPCCDBA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>14</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2ACR</name>
         <displayName>C2ACR</displayName>
         <addressOffset>0x05C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PES</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ICRST</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ICEN</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PRFTEN</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2SR</name>
         <displayName>C2SR</displayName>
         <addressOffset>0x060</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PESD</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CFGBSY</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BSY</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RDERR</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FASTERR</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MISERR</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PGSERR</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SIZERR</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PGAERR</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WRPERR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PROGERR</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPERR</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOP</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2CR</name>
         <displayName>C2CR</displayName>
         <addressOffset>0x064</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RDERRIE</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ERRIE</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EOPIE</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSTPG</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>STRT</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PNB</name>
             <bitOffset>3</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>MER</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PER</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PG</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SFR</name>
         <displayName>SFR</displayName>
         <addressOffset>0x080</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DDS</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSD</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SFSA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SRRVR</name>
         <displayName>SRRVR</displayName>
         <addressOffset>0x084</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>C2OPT</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>NBRSD</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SNBRSA</name>
             <bitOffset>25</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>BRSD</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SBRSA</name>
             <bitOffset>18</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>SBRV</name>
             <bitOffset>0</bitOffset>
             <bitWidth>18</bitWidth>
           </field>
         </fields>
       </register>
