morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>PKA</name>
     <groupName>PKA</groupName>
     <baseAddress>0x58002000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <registers>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ADDRERRIE</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RAMERRIE</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PROCENDIE</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MODE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>START</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR</name>
         <displayName>SR</displayName>
         <addressOffset>0x004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ADDRERRF</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RAMERRF</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PROCENDF</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BUSY</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CLRFR</name>
         <displayName>CLRFR</displayName>
         <addressOffset>0x008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ADDRERRFC</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RAMERRFC</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PROCENDFC</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
     </registers>
   </peripheral>
   <peripheral>
     <name>HSEM</name>
     <groupName>HSEM</groupName>
     <baseAddress>0x58001400</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>HSEM</name>
       <value>46</value>
     </interrupt>
     <registers>
       <register>
         <name>R0</name>
         <displayName>R0</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>PROCID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>R1</name>
         <displayName>R1</displayName>
         <addressOffset>0x004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>PROCID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>R31</name>
         <displayName>R31</displayName>
         <addressOffset>0x07C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>PROCID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>RLR0</name>
         <displayName>RLR0</displayName>
         <addressOffset>0x080</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>PROCID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>RLR1</name>
         <displayName>RLR1</displayName>
         <addressOffset>0x084</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>PROCID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>RLR31</name>
         <displayName>RLR31</displayName>
         <addressOffset>0x0FC</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LOCK</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>PROCID</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C1IER</name>
         <displayName>C1IER</displayName>
         <addressOffset>0x100</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ISE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C1ICR</name>
         <displayName>C1ICR</displayName>
         <addressOffset>0x104</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ISC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C1ISR</name>
         <displayName>C1ISR</displayName>
         <addressOffset>0x108</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ISF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C1MISR</name>
         <displayName>C1MISR</displayName>
         <addressOffset>0x10C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MISF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2IER</name>
         <displayName>C2IER</displayName>
         <addressOffset>0x110</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ISE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2ICR</name>
         <displayName>C2ICR</displayName>
         <addressOffset>0x114</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ISC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2ISR</name>
         <displayName>C2ISR</displayName>
         <addressOffset>0x118</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ISF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>C2MISR</name>
         <displayName>C2MISR</displayName>
         <addressOffset>0x11C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MISF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x140</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>KEY</name>
             <bitOffset>16</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
           <field>
             <name>COREID</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>KEYR</name>
         <displayName>KEYR</displayName>
         <addressOffset>0x144</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>KEY</name>
             <bitOffset>16</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
