morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>PWR</name>
     <groupName>PWR</groupName>
     <baseAddress>0x58000400</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>C2SEV_PWR_C2H</name>
       <value>21</value>
     </interrupt>
     <interrupt>
       <name>PWR_SOTF_BLEACT_802ACT_RFPHASE</name>
       <value>43</value>
     </interrupt>
     <registers>
       <register>
         <name>CR1</name>
         <displayName>CR1</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LPR</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>VOS</name>
             <bitOffset>9</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>DBP</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FPDS</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FPDR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LPMS</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR2</name>
         <displayName>CR2</displayName>
         <addressOffset>0x004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>USV</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PVME3</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PVME1</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PLS</name>
             <bitOffset>1</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>PVDE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR3</name>
         <displayName>CR3</displayName>
         <addressOffset>0x008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>EIWUL</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EC2H</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>E802A</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EBLEA</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ECRPE</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>APC</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RRS</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EBORHSMPSFB</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EWUP5</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EWUP4</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EWUP3</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EWUP2</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EWUP1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR4</name>
         <displayName>CR4</displayName>
         <addressOffset>0x00C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>C2BOOT</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>VBRS</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>VBE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WP5</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WP4</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WP3</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WP2</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WP1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR1</name>
         <displayName>SR1</displayName>
         <addressOffset>0x010</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>WUFI</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>C2HF</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>802AF</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BLEAF</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CRPEF</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>802WUF</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BLEWUF</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BORHF</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMPSFBF</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WUF5</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WUF4</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WUF3</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WUF2</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WUF1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR2</name>
         <displayName>SR2</displayName>
         <addressOffset>0x014</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PVMO3</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PVMO1</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PVDO</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>VOSF</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>REGLPF</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>REGLPS</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMPSF</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMPSBF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SCR</name>
         <displayName>SCR</displayName>
         <addressOffset>0x018</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CC2HF</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>C802AF</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CBLEAF</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CCRPEF</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>C802WUF</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CBLEWUF</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CBORHF</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CSMPSFBF</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWUF5</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWUF4</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWUF3</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWUF2</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWUF1</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR5</name>
         <displayName>CR5</displayName>
         <addressOffset>0x01C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SMPSEN</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BORHC</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMPSSC</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>SMPSVOS</name>
             <bitOffset>0</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PUCRA</name>
         <displayName>PUCRA</displayName>
         <addressOffset>0x020</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PU15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PDCRA</name>
         <displayName>PDCRA</displayName>
         <addressOffset>0x024</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PD15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PUCRB</name>
         <displayName>PUCRB</displayName>
         <addressOffset>0x028</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PU15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PU0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PDCRB</name>
         <displayName>PDCRB</displayName>
         <addressOffset>0x02C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PD15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>PD0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
