morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>SAI</name>
     <groupName>SAI</groupName>
     <baseAddress>0x40015400</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>SAI</name>
       <value>38</value>
     </interrupt>
     <registers>
       <register>
         <name>ACR1</name>
         <displayName>ACR1</displayName>
         <addressOffset>0x0004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MCKEN</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OSR</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MCKDIV</name>
             <bitOffset>20</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>NODIV</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAEN</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SAIEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OUTDRIV</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MONO</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCEN</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CKSTR</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSBFIRST</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DS</name>
             <bitOffset>5</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>PRTCFG</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ACR2</name>
         <displayName>ACR2</displayName>
         <addressOffset>0x0008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>COMP</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CPL</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTECN</name>
             <bitOffset>7</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>MUTE_VAL</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TRIS</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FFLUS</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FTH</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AFRCR</name>
         <displayName>AFRCR</displayName>
         <addressOffset>0x000C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FSOFF</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSDEF</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSALL</name>
             <bitOffset>8</bitOffset>
             <bitWidth>7</bitWidth>
           </field>
           <field>
             <name>FRL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ASLOTR</name>
         <displayName>ASLOTR</displayName>
         <addressOffset>0x0010</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SLOTEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
           <field>
             <name>NBSLOT</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>SLOTSZ</name>
             <bitOffset>6</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>FBOFF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AIM</name>
         <displayName>AIM</displayName>
         <addressOffset>0x0014</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LFSDETIE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AFSDETIE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CNRDYIE</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FREQIE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WCKCFGIE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTEDETIE</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVRUDRIE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ASR</name>
         <displayName>ASR</displayName>
         <addressOffset>0x0018</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FLVL</name>
             <bitOffset>16</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>LFSDET</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AFSDET</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CNRDY</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FREQ</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WCKCFG</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTEDET</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVRUDR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ACLRFR</name>
         <displayName>ACLRFR</displayName>
         <addressOffset>0x001C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CLFSDET</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CAFSDET</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CCNRDY</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWCKCFG</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CMUTEDET</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COVRUDR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ADR</name>
         <displayName>ADR</displayName>
         <addressOffset>0x0020</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DATA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BCR1</name>
         <displayName>BCR1</displayName>
         <addressOffset>0x0024</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MCKEN</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OSR</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MCKDIV</name>
             <bitOffset>20</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>NODIV</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAEN</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SAIEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OUTDRIV</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MONO</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCEN</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CKSTR</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LSBFIRST</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DS</name>
             <bitOffset>5</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>PRTCFG</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BCR2</name>
         <displayName>BCR2</displayName>
         <addressOffset>0x0028</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>COMP</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CPL</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTECN</name>
             <bitOffset>7</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>MUTE_VAL</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TRIS</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FFLUS</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FTH</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BFRCR</name>
         <displayName>BFRCR</displayName>
         <addressOffset>0x002C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FSOFF</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSPOL</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSDEF</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FSALL</name>
             <bitOffset>8</bitOffset>
             <bitWidth>7</bitWidth>
           </field>
           <field>
             <name>FRL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BSLOTR</name>
         <displayName>BSLOTR</displayName>
         <addressOffset>0x0030</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SLOTEN</name>
             <bitOffset>16</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
           <field>
             <name>NBSLOT</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>SLOTSZ</name>
             <bitOffset>6</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>FBOFF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BIM</name>
         <displayName>BIM</displayName>
         <addressOffset>0x0034</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LFSDETIE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AFSDETIE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CNRDYIE</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FREQIE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WCKCFGIE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTEDETIE</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVRUDRIE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BSR</name>
         <displayName>BSR</displayName>
         <addressOffset>0x0038</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FLVL</name>
             <bitOffset>16</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>LFSDET</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AFSDET</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CNRDY</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FREQ</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>WCKCFG</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MUTEDET</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OVRUDR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BCLRFR</name>
         <displayName>BCLRFR</displayName>
         <addressOffset>0x003C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CLFSDET</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CAFSDET</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CCNRDY</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CWCKCFG</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CMUTEDET</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COVRUDR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BDR</name>
         <displayName>BDR</displayName>
         <addressOffset>0x0040</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DATA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PDMCR</name>
         <displayName>PDMCR</displayName>
         <addressOffset>0x0044</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CKEN2</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CKEN1</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MICNBR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PDMEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PDMDLY</name>
         <displayName>PDMDLY</displayName>
         <addressOffset>0x0048</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DLYM4R</name>
             <bitOffset>28</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM4L</name>
             <bitOffset>24</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM3R</name>
             <bitOffset>20</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM3L</name>
             <bitOffset>16</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM2R</name>
             <bitOffset>12</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM2L</name>
             <bitOffset>8</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM1R</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>DLYM1L</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
