morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>QUADSPI</name>
     <groupName>QUADSPI</groupName>
     <baseAddress>0xa0001000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>QUADSPI</name>
       <value>50</value>
     </interrupt>
     <registers>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x0000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PRESCALER</name>
             <bitOffset>24</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>PMM</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>APMS</name>
             <bitOffset>22</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TOIE</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMIE</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FTIE</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TCIE</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TEIE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FTHRES</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>SSHIFT</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TCEN</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DMAEN</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ABORT</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>EN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DCR</name>
         <displayName>DCR</displayName>
         <addressOffset>0x0004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FSIZE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>CSHT</name>
             <bitOffset>8</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>CKMODE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR</name>
         <displayName>SR</displayName>
         <addressOffset>0x0008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FLEVEL</name>
             <bitOffset>8</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>BUSY</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TOF</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMF</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FTF</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TCF</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TEF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>FCR</name>
         <displayName>FCR</displayName>
         <addressOffset>0x000C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CTOF</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CSMF</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CTCF</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CTEF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DLR</name>
         <displayName>DLR</displayName>
         <addressOffset>0x0010</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCR</name>
         <displayName>CCR</displayName>
         <addressOffset>0x0014</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DDRM</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SIOO</name>
             <bitOffset>28</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>FMODE</name>
             <bitOffset>26</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>DMODE</name>
             <bitOffset>24</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>DCYC</name>
             <bitOffset>18</bitOffset>
             <bitWidth>5</bitWidth>
           </field>
           <field>
             <name>ABSIZE</name>
             <bitOffset>16</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>ABMODE</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>ADSIZE</name>
             <bitOffset>12</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>ADMODE</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>IMODE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>INSTRUCTION</name>
             <bitOffset>0</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AR</name>
         <displayName>AR</displayName>
         <addressOffset>0x0018</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ADDRESS</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ABR</name>
         <displayName>ABR</displayName>
         <addressOffset>0x001C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ALTERNATE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DR</name>
         <displayName>DR</displayName>
         <addressOffset>0x0020</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>DATA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PSMKR</name>
         <displayName>PSMKR</displayName>
         <addressOffset>0x0024</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MASK</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PSMAR</name>
         <displayName>PSMAR</displayName>
         <addressOffset>0x0028</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MATCH</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PIR</name>
         <displayName>PIR</displayName>
         <addressOffset>0x002C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>INTERVAL</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>LPTR</name>
         <displayName>LPTR</displayName>
         <addressOffset>0x0030</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TIMEOUT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
