morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>RNG</name>
     <groupName>RNG</groupName>
     <baseAddress>0x58001000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>RNG</name>
       <value>53</value>
     </interrupt>
     <registers>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x000</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CED</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>IE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>RNGEN</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR</name>
         <displayName>SR</displayName>
         <addressOffset>0x004</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SEIS</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CEIS</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SECS</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CECS</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>DRDY</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DR</name>
         <displayName>DR</displayName>
         <addressOffset>0x008</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>RNDATA</name>
             <bitOffset>0</bitOffset>
             <bitWidth>32</bitWidth>
           </field>
         </fields>
       </register>
     </registers>
   </peripheral>
   <peripheral>
     <name>CRS</name>
     <groupName>CRS</groupName>
     <baseAddress>0x40006000</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>CRS</name>
       <value>42</value>
     </interrupt>
     <registers>
       <register>
         <name>CR</name>
         <displayName>CR</displayName>
         <addressOffset>0x00</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TRIM</name>
             <bitOffset>8</bitOffset>
             <bitWidth>6</bitWidth>
           </field>
           <field>
             <name>SWSYNC</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>AUTOTRIMEN</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CEN</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ESYNCIE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ERRIE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCWARNIE</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCOKIE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CFGR</name>
         <displayName>CFGR</displayName>
         <addressOffset>0x04</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>SYNCPOL</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCSRC</name>
             <bitOffset>28</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SYNCDIV</name>
             <bitOffset>24</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>FELIM</name>
             <bitOffset>16</bitOffset>
             <bitWidth>8</bitWidth>
           </field>
           <field>
             <name>RELOAD</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ISR</name>
         <displayName>ISR</displayName>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>FECAP</name>
             <bitOffset>16</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
           <field>
             <name>FEDIR</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TRIMOVF</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCMISS</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCERR</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ESYNCF</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ERRF</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCWARNF</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCOKF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ICR</name>
         <displayName>ICR</displayName>
         <addressOffset>0x0C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ESYNCC</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ERRC</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCWARNC</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SYNCOKC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
