morbos/STM32/WB/SVD/STM32WB55x.svd
       <register>
         <name>BSRR</name>
         <displayName>BSRR</displayName>
         <addressOffset>0x18</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>BR15</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR14</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR13</name>
             <bitOffset>29</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR12</name>
             <bitOffset>28</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR11</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR10</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR9</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR8</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR7</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR6</name>
             <bitOffset>22</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR5</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR4</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR3</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR2</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR1</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR0</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>LCKR</name>
         <displayName>LCKR</displayName>
         <addressOffset>0x1C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LCKK</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AFRL</name>
         <displayName>AFRL</displayName>
         <addressOffset>0x20</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AFSEL7</name>
             <bitOffset>28</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL6</name>
             <bitOffset>24</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL5</name>
             <bitOffset>20</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL4</name>
             <bitOffset>16</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL3</name>
             <bitOffset>12</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL2</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL1</name>
             <bitOffset>4</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>AFRH</name>
         <displayName>AFRH</displayName>
         <addressOffset>0x24</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>AFSEL15</name>
             <bitOffset>28</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL14</name>
             <bitOffset>24</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL13</name>
             <bitOffset>20</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL12</name>
             <bitOffset>16</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL11</name>
             <bitOffset>12</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL10</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL9</name>
             <bitOffset>4</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>AFSEL8</name>
             <bitOffset>0</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BRR</name>
         <displayName>BRR</displayName>
         <addressOffset>0x28</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>BR15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
