morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>GPIOC</name>
     <groupName>GPIO</groupName>
     <baseAddress>0x48000800</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <registers>
       <register>
         <name>MODER</name>
         <displayName>MODER</displayName>
         <addressOffset>0x00</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MODE15</name>
             <bitOffset>30</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE14</name>
             <bitOffset>28</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE13</name>
             <bitOffset>26</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE12</name>
             <bitOffset>24</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE11</name>
             <bitOffset>22</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE10</name>
             <bitOffset>20</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE9</name>
             <bitOffset>18</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE8</name>
             <bitOffset>16</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE7</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE6</name>
             <bitOffset>12</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE5</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE4</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE3</name>
             <bitOffset>6</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE2</name>
             <bitOffset>4</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE1</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>MODE0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OTYPER</name>
         <displayName>OTYPER</displayName>
         <addressOffset>0x04</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OT15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OT0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>OSPEEDR</name>
         <displayName>OSPEEDR</displayName>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OSPEED15</name>
             <bitOffset>30</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED14</name>
             <bitOffset>28</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED13</name>
             <bitOffset>26</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED12</name>
             <bitOffset>24</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED11</name>
             <bitOffset>22</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED10</name>
             <bitOffset>20</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED9</name>
             <bitOffset>18</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED8</name>
             <bitOffset>16</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED7</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED6</name>
             <bitOffset>12</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED5</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED4</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED3</name>
             <bitOffset>6</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED2</name>
             <bitOffset>4</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED1</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OSPEED0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PUPDR</name>
         <displayName>PUPDR</displayName>
         <addressOffset>0x0C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PUPD15</name>
             <bitOffset>30</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD14</name>
             <bitOffset>28</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD13</name>
             <bitOffset>26</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD12</name>
             <bitOffset>24</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD11</name>
             <bitOffset>22</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD10</name>
             <bitOffset>20</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD9</name>
             <bitOffset>18</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD8</name>
             <bitOffset>16</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD7</name>
             <bitOffset>14</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD6</name>
             <bitOffset>12</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD5</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD4</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD3</name>
             <bitOffset>6</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD2</name>
             <bitOffset>4</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD1</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>PUPD0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>IDR</name>
         <displayName>IDR</displayName>
         <addressOffset>0x10</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ID15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ID0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ODR</name>
         <displayName>ODR</displayName>
         <addressOffset>0x14</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OD15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OD0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>BSRR</name>
         <displayName>BSRR</displayName>
         <addressOffset>0x18</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>BR15</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR14</name>
             <bitOffset>30</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR13</name>
             <bitOffset>29</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR12</name>
             <bitOffset>28</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR11</name>
             <bitOffset>27</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR10</name>
             <bitOffset>26</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR9</name>
             <bitOffset>25</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR8</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR7</name>
             <bitOffset>23</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR6</name>
             <bitOffset>22</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR5</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR4</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR3</name>
             <bitOffset>19</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR2</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR1</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BR0</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BS0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>LCKR</name>
         <displayName>LCKR</displayName>
         <addressOffset>0x1C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>LCKK</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK15</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK14</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK13</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK12</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK11</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK10</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK9</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK8</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK7</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK6</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK5</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK4</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK3</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK2</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK1</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>LCK0</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
