morbos/STM32/WB/SVD/STM32WB55x.svd
     </registers>
   </peripheral>
   <peripheral>
     <name>TIM1</name>
     <groupName>TIM1</groupName>
     <baseAddress>0x40012c00</baseAddress>
     <addressBlock>
       <offset>0</offset>
       <size>0x400</size>
       <usage>registers</usage>
     </addressBlock>
     <interrupt>
       <name>TIM1_CC</name>
       <value>27</value>
     </interrupt>
     <interrupt>
       <name>TIM1_BRK</name>
       <value>24</value>
     </interrupt>
     <registers>
       <register>
         <name>CR1</name>
         <displayName>CR1</displayName>
         <addressOffset>0x00</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>UIFREMAP</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CKD</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>ARPE</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CMS</name>
             <bitOffset>5</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>DIR</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OPM</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>URS</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>UDIS</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CEN</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CR2</name>
         <displayName>CR2</displayName>
         <addressOffset>0x04</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>MMS2</name>
             <bitOffset>20</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>OIS6</name>
             <bitOffset>18</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS5</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS4</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS3N</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS3</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS2N</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS2</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS1N</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OIS1</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TI1S</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>MMS</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>CCDS</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CCUS</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CCPC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SMCR</name>
         <displayName>SMCR</displayName>
         <addressOffset>0x08</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TS</name>
             <bitOffset>20</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>SMS</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ETP</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ECE</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>ETPS</name>
             <bitOffset>12</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>ETF</name>
             <bitOffset>8</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>MSM</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TS</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>OCCS</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SMS</name>
             <bitOffset>0</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>DIER</name>
         <displayName>DIER</displayName>
         <addressOffset>0x0C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>TDE</name>
             <bitOffset>14</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COMDE</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4DE</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3DE</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2DE</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1DE</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>UDE</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BIE</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COMIE</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4IE</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3IE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2IE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1IE</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>UIE</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>SR</name>
         <displayName>SR</displayName>
         <addressOffset>0x10</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CC6IF</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC5IF</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>SBIF</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4OF</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3OF</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2OF</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1OF</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>B2IF</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BIF</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TIF</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COMIF</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4IF</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3IF</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2IF</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1IF</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>UIF</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>EGR</name>
         <displayName>EGR</displayName>
         <addressOffset>0x14</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>B2G</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>BG</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>TG</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>COM</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4G</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3G</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2G</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1G</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>UG</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCMR1_Output</name>
         <displayName>CCMR1_Output</displayName>
         <addressOffset>0x18</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OC2M</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC1M</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC2CE</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC2M</name>
             <bitOffset>12</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>OC2PE</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC2FE</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2S</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OC1CE</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC1M</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>OC1PE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC1FE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1S</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCMR1_Input</name>
         <displayName>CCMR1_Input</displayName>
         <addressOffset>0x18</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IC2F</name>
             <bitOffset>12</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>IC2PSC</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CC2S</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>IC1F</name>
             <bitOffset>4</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>IC1PSC</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CC1S</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCMR2_Output</name>
         <displayName>CCMR2_Output</displayName>
         <addressOffset>0x1C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>OC4M</name>
             <bitOffset>24</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC3M</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC4CE</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC4M</name>
             <bitOffset>12</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>OC4PE</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC4FE</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4S</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>OC3CE</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC3M</name>
             <bitOffset>4</bitOffset>
             <bitWidth>3</bitWidth>
           </field>
           <field>
             <name>OC3PE</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>OC3FE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3S</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCMR2_Input</name>
         <displayName>CCMR2_Input</displayName>
         <addressOffset>0x1C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>IC4F</name>
             <bitOffset>12</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>IC4PSC</name>
             <bitOffset>10</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CC4S</name>
             <bitOffset>8</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>IC3F</name>
             <bitOffset>4</bitOffset>
             <bitWidth>4</bitWidth>
           </field>
           <field>
             <name>IC3PSC</name>
             <bitOffset>2</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
           <field>
             <name>CC3S</name>
             <bitOffset>0</bitOffset>
             <bitWidth>2</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CCER</name>
         <displayName>CCER</displayName>
         <addressOffset>0x20</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>CC6P</name>
             <bitOffset>21</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC6E</name>
             <bitOffset>20</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC5P</name>
             <bitOffset>17</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC5E</name>
             <bitOffset>16</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4NP</name>
             <bitOffset>15</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4P</name>
             <bitOffset>13</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC4E</name>
             <bitOffset>12</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3NP</name>
             <bitOffset>11</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3NE</name>
             <bitOffset>10</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3P</name>
             <bitOffset>9</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC3E</name>
             <bitOffset>8</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2NP</name>
             <bitOffset>7</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2NE</name>
             <bitOffset>6</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2P</name>
             <bitOffset>5</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC2E</name>
             <bitOffset>4</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1NP</name>
             <bitOffset>3</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1NE</name>
             <bitOffset>2</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1P</name>
             <bitOffset>1</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CC1E</name>
             <bitOffset>0</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>CNT</name>
         <displayName>CNT</displayName>
         <addressOffset>0x24</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>UIFCPY</name>
             <bitOffset>31</bitOffset>
             <bitWidth>1</bitWidth>
           </field>
           <field>
             <name>CNT</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>PSC</name>
         <displayName>PSC</displayName>
         <addressOffset>0x28</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>PSC</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
       <register>
         <name>ARR</name>
         <displayName>ARR</displayName>
         <addressOffset>0x2C</addressOffset>
         <size>0x20</size>
         <access>read-write</access>
         <resetValue>0x00000000</resetValue>
         <fields>
           <field>
             <name>ARR</name>
             <bitOffset>0</bitOffset>
             <bitWidth>16</bitWidth>
           </field>
         </fields>
       </register>
